/*-----------------------------------------------------------------------------
 * AtEthercat.h
 * Copyright                acontis technologies GmbH, Weingarten, Germany
 * Response                 Stefan Zintgraf
 * Description              interface to the ethercat master
 *---------------------------------------------------------------------------*/

#ifndef INC_ATETHERCAT
#define INC_ATETHERCAT 1

/*-INCLUDE-------------------------------------------------------------------*/
#ifndef INC_ECOS
#include "EcOs.h"
#endif
#ifndef INC_ECERROR
#include "EcError.h"
#endif
#ifndef INC_ECINTERFACECOMMON
#include "EcInterfaceCommon.h"
#endif
#ifndef INC_ECVERSION
#include "EcVersion.h"
#endif
#ifndef INC_ECLINK
#include "EcLink.h"
#endif
#ifndef INC_ETHERNETSERVICES
#include "EthernetServices.h"
#endif

/*-DEFINES/MACROS------------------------------------------------------------*/

#define ATECAT_SIGNATURE_PATTERN                    0xAEC00000

#define ATECAT_SIGNATURE (  ATECAT_SIGNATURE_PATTERN       \
                         | (ATECAT_VERS_MAJ         << 16) \
                         | (ATECAT_VERS_MIN         << 12) \
                         | (ATECAT_VERS_SERVICEPACK <<  8) \
                         | (ATECAT_VERS_BUILD       <<  0) \
                         )

/* EtherCat specific control codes */
#define EC_IOCTL_GENERIC                            0x00000000
#define EC_IOCTL_DC                                 0x00030000

    /* Hot Connect (HC) */
#define EC_IOCTL_HC_SETMODE                         (EC_IOCTL_HC | 1)
#define EC_IOCTL_HC_GETMODE                         (EC_IOCTL_HC | 2)
#define EC_IOCTL_HC_CONFIGURETIMEOUTS               (EC_IOCTL_HC | 3)

    /* private (PRIVATE) */
#define EC_IOCTL_SET_FRAME_LOSS_SIMULATION          (EC_IOCTL_PRIVATE | 1)
#define EC_IOCTL_SET_RXFRAME_LOSS_SIMULATION        (EC_IOCTL_PRIVATE | 2)
#define EC_IOCTL_SET_TXFRAME_LOSS_SIMULATION        (EC_IOCTL_PRIVATE | 3)
#define EC_IOCTL_GET_FAST_CONTEXT                   (EC_IOCTL_PRIVATE | 4)
#define EC_IOCTL_SET_OEM_KEY                        (EC_IOCTL_PRIVATE | 5)
#define EC_IOCTL_CHECK_OEM_KEY                      (EC_IOCTL_PRIVATE | 6)

/* EtherCat CoE entry description value information bit definitions */
#define EC_COE_ENTRY_ObjAccess                      0x01
#define EC_COE_ENTRY_ObjCategory                    0x02
#define EC_COE_ENTRY_PdoMapping                     0x04
#define EC_COE_ENTRY_UnitType                       0x08
#define EC_COE_ENTRY_DefaultValue                   0x10
#define EC_COE_ENTRY_MinValue                       0x20
#define EC_COE_ENTRY_MaxValue                       0x40

/* EtherCat CoE entry access bit definitions */
#define EC_COE_ENTRY_Access_R_PREOP                 0x01
#define EC_COE_ENTRY_Access_R_SAFEOP                0x02
#define EC_COE_ENTRY_Access_R_OP                    0x04
#define EC_COE_ENTRY_Access_W_PREOP                 0x08
#define EC_COE_ENTRY_Access_W_SAFEOP                0x10
#define EC_COE_ENTRY_Access_W_OP                    0x20

#define INVALID_SLAVE_ID                            ((EC_T_DWORD)0xFFFFFFFF)
#define INVALID_BUS_INDEX                           ((EC_T_DWORD)0xFFFFFFFF)
#define INVALID_FIXED_ADDR                          ((EC_T_WORD)0x0)
#define INVALID_AUTO_INC_ADDR                       ((EC_T_WORD)0x1)

#ifndef MAX_NUMOF_MASTER_INSTANCES
#define MAX_NUMOF_MASTER_INSTANCES                  12               /* maximum number of master instances */
#endif

#ifndef INSTANCE_MASTER_DEFAULT                     /* can be overriden in AtEmRasClnt.h */
#define INSTANCE_MASTER_DEFAULT                     ((EC_T_DWORD)0)  /* default master instance to be used by emXXXXX API to access same instance as ecatXXXXX API */
#endif

#if (defined INCLUDE_TRACE_DATA)
#define TRACE_DATA_CMD_ADO                          ((EC_T_WORD)0x4154)
#endif /* INCLUDE_TRACE_DATA */

/*-FORWARD DECLARATIONS------------------------------------------------------*/
struct _EC_T_LINK_PARMS;
struct _EC_T_NOTIFYPARMS;
struct _EC_T_OS_PARMS;

/*-TYPEDEFS/ENUMS------------------------------------------------------------*/

/* EtherCat callback function pointer */
typedef EC_T_DWORD (*EC_PF_NOTIFY)(                 EC_T_DWORD dwCode,
                                                    struct _EC_T_NOTIFYPARMS* pParms    );

/* EtherCAT ioctl parameters */
#include EC_PACKED_INCLUDESTART(8)
typedef struct _EC_T_IOCTLOPARMS
{
    EC_T_BYTE*      pbyInBuf;                       /*< [in] input data buffer */
    EC_T_DWORD      dwInBufSize;                    /*< [in] size of input data buffer in byte */
    EC_T_BYTE*      pbyOutBuf;                      /*< [out] output data buffer */
    EC_T_DWORD      dwOutBufSize;                   /*< [in] size of output data buffer in byte */
    EC_T_DWORD*     pdwNumOutData;                  /*< [out] number of output data bytes stored in output data buffer */
} EC_PACKED(8) EC_T_IOCTLPARMS;
#include EC_PACKED_INCLUDESTOP

/* Client register parameters */
typedef struct _EC_T_REGISTERPARMS
{
    EC_T_VOID*      pCallerData;                    /*< [in] used by all callback functions */
    EC_PF_NOTIFY    pfnNotify;                      /*< [in] notify callback function pointer */
}/*EC_PACKED */EC_T_REGISTERPARMS; /* Packed function pointer causes error with VxWorks DIAB compiler */

/* Client register result */
#include EC_PACKED_INCLUDESTART(1)
typedef struct _EC_T_REGISTERRESULTS
{
    EC_T_DWORD      dwClntId;                       /*< [out] Client ID */
    EC_T_BYTE*      pbyPDIn;                        /*< [out] Pointer to process data input memory */
    EC_T_DWORD      dwPDInSize;                     /*< [out] Size of process data input memory (in bytes) */
    EC_T_BYTE*      pbyPDOut;                       /*< [out] Pointer to process data output memory */
    EC_T_DWORD      dwPDOutSize;                    /*< [out] Size of process data output memory (in bytes) */
} EC_PACKED(1) EC_T_REGISTERRESULTS;
#include EC_PACKED_INCLUDESTOP

/* Msg logging */
typedef EC_T_BOOL (*EC_T_PFLOGMSG_CB)(const EC_T_CHAR* szFormat, EC_T_VALIST vaArgs);

/* Frame logging */
#define EC_LOG_FRAME_FLAG_MASTERSTATE_MASK 0xFFFF   /* Bit 0 to 15 */
#define EC_LOG_FRAME_FLAG_ACYC_FRAME       (1<<16)  /* Bit 16 (0x00010000): 0=cyclic frame, 1=acyclic frame */
#define EC_LOG_FRAME_FLAG_DBG_FRAME        (1<<17)  /* Bit 17 (0x00020000): 0=EtherCAT frame, 1=debug frame */
#define EC_LOG_FRAME_FLAG_RED_FRAME        (1<<18)  /* Bit 18 (0x00040000): 0=main frame, 1=red frame */
#define EC_LOG_FRAME_FLAG_RX_FRAME         (1<<19)  /* Bit 19 (0x00080000): 0=TX frame, 1=RX frame */
typedef EC_T_VOID (*EC_T_PFLOGFRAME_CB)(EC_T_VOID* pvContext, EC_T_DWORD dwLogFlags, EC_T_DWORD dwFrameSize, EC_T_BYTE* pbyFrame);

/* Master initialization parameters, see ecatInitMaster */
#include EC_PACKED_INCLUDESTART(8)
typedef struct _EC_T_INIT_MASTER_PARMS
{
    EC_T_DWORD  dwSignature;                        /*< [in] set to ATECAT_SIGNATURE */
    EC_T_DWORD  dwSize;                             /*< [in] set to sizeof(EC_T_INIT_MASTER_PARMS) */

    struct _EC_T_OS_PARMS*      pOsParms;           /*< [in] OS layer parameters */
    struct _EC_T_LINK_PARMS*    pLinkParms;         /*< [in] Link layer parameters */
    struct _EC_T_LINK_PARMS*    pLinkParmsRed;      /*< [in] Link layer parameters for red device */

    EC_T_DWORD  dwBusCycleTimeUsec;                 /*< [in] [usec] bus cycle time in microseconds */

    /* memory */
    EC_T_DWORD  dwMaxBusSlaves;                     /*< [in] maximum pre-allocated bus slave objects */
    EC_T_DWORD  dwMaxQueuedEthFrames;               /*< [in] maximum queued Ethernet frames */
    EC_T_DWORD  dwAdditionalEoEEndpoints;           /*< [in] additional EoE endpoints */

    /* bus load */
    EC_T_DWORD  dwMaxSlaveCmdPerFrame;              /*< [in] maximum slave commands per frame */
    EC_T_DWORD  dwMaxSentQueuedFramesPerCycle;      /*< [in] maximum queued frames sent with eUsrJob_SendAcycFrames within one cycle */

    /* CPU load */
    EC_T_DWORD  dwMaxSlavesProcessedPerCycle;       /*< [in] maximum slave-related state machine calls per cycle */

    /* retry and timeouts */
    EC_T_DWORD  dwEcatCmdMaxRetries;                /*< [in] maximum retries to send pending ethercat command frames */
    EC_T_DWORD  dwEcatCmdTimeout;                   /*< [in] timeout to send pending ethercat command frames */
    EC_T_DWORD  dwEoETimeout;                       /*< [in] timeout sending EoE frames */
    EC_T_DWORD  dwFoEBusyTimeout;                   /*< [in] obsolete */

    /* VLAN */
    EC_T_BOOL   bVLANEnable;                        /*< [in] E=enable (1/0) */
    EC_T_WORD   wVLANId;                            /*< [in] I=VLAN Id (12Bit)*/
    EC_T_BYTE   byVLANPrio;                         /*< [in] P=Prio (3Bit) */

    /* logging */
    EC_T_DWORD  dwLogLevel;                         /*< [in] log level. See EC_LOG_LEVEL_... */
    EC_T_PFLOGMSG_CB    pfLogMsgCallBack;           /*< [in] optional call back function to log msg from the EC-Master. set to EC_NULL if not used. */
    EC_T_BOOL   bLogToLinkLayer;                    /*< [in] EC_TRUE: error messages are sent to the link layer */

    EC_T_DWORD  dwReserved[4];

} EC_PACKED(8) EC_T_INIT_MASTER_PARMS;
#include EC_PACKED_INCLUDESTOP

/* link layer debug message */
#include EC_PACKED_INCLUDESTART(1)
typedef struct _EC_T_LINKLAYER_DBG_MSG_DESC
{
    EC_T_BYTE   byEthTypeByte0;                     /*< [in] Ethernet type byte 0 */
    EC_T_BYTE   byEthTypeByte1;                     /*< [in] Ethernet type byte 0 */
    EC_T_WORD   wRes;
    EC_T_CHAR*  szMsg;                              /*< [in] message to send to link layer */
} EC_PACKED(1) EC_T_LINKLAYER_DBG_MSG_DESC;
#include EC_PACKED_INCLUDESTOP

/* Distributed clocks */
#if (defined INCLUDE_DC_SUPPORT)
#include EC_PACKED_INCLUDESTART(8)
typedef struct _EC_T_DC_SYNCSO_CB_PARM
{
    EC_T_VOID*              pvContext;              /*< [in] Calling environment context */
    EC_T_DWORD              dwTimeStamp;            /*< [in] Pre-Send Timestamp */
    EC_T_DWORD              dwPostTimeStamp;        /*< [in] Post-Send Timestamp */
    EC_T_DWORD              dwBusTimeLo;            /*< [in] Bus Time Lower 32 Bit */
    EC_T_DWORD              dwBusTimeHi;            /*< [in] Bus Time Upper 32 Bit */
    EC_T_DWORD              dwTimeStampResult;      /*< [in] Result of stamp */

    EC_T_DWORD	            dwSyncPeriodLength;     /*< [in] Time between two consecutive SYNC0 signals of clock master slave in nsec. */

    EC_T_DWORD              dwStartSyncTimeLo;      /*< [out] Sync Start Time Lower 32 Bit */
    EC_T_DWORD              dwStartSyncTimeHi;      /*< [out] Sync Start Time Upper 32 Bit */

} EC_PACKED(8)  EC_T_DC_SYNCSO_CB_PARM, *EC_PT_DC_SYNCSO_CB_PARM;
#include EC_PACKED_INCLUDESTOP

typedef EC_T_DWORD (*EC_T_PFSYNCSO_CB)(EC_T_DC_SYNCSO_CB_PARM* pParm);

#include EC_PACKED_INCLUDESTART(8)
typedef struct _EC_T_DC_SYNCSO_REGDESC
{
    EC_T_DC_SYNCSO_CB_PARM*     pCallbackParm;      /*< [in] Callback Parameter */
    EC_T_PFSYNCSO_CB            pfnCallback;        /*< [in] Callback Function */
} EC_PACKED(8)  EC_T_DC_SYNCSO_REGDESC, *EC_PT_DC_SYNCSO_REGDESC;
#include EC_PACKED_INCLUDESTOP

#include EC_PACKED_INCLUDESTART(8)
typedef struct _EC_T_DC_CONFIGURE
{
    EC_T_DWORD                  dwClntId;                   /*< [in] Reserved */
    EC_T_DWORD                  dwTimeout;                  /*< [in] DC Timeout value in msec */
    EC_T_DWORD                  dwDevLimit;                 /*< [in] deviation limit value */
    EC_T_DWORD                  dwSettleTime;               /*< [in] config values for settle time */
    EC_T_DWORD                  dwTotalBurstLength;         /*< [in] Total size of the initialization burst */
    EC_T_DWORD                  dwBurstBulk;                /*< [in] Amount of burst frames per cycle during initialization burst */
    EC_T_BOOL                   bBulkInLinkLayer;           /*< [in] If EC_TRUE, bulk is realized by link layer (link layer must support it), otherwise by master */
    EC_T_BOOL                   bAcycDistributionDisabled;  /*< [in] If EC_TRUE, acyclic distribution is disabled */
    EC_T_DWORD                  dwDcStartTimeGrid;          /*< [in] Time grid in nsec to align DC start time */
    EC_T_DWORD                  dwReserved[2];              /*< [in/out] reserved */
} EC_PACKED(8)  EC_T_DC_CONFIGURE, *EC_PT_DC_CONFIGURE;
#include EC_PACKED_INCLUDESTOP

typedef enum _EC_T_DCM_MODE
{
    eDcmMode_Off               = 0,
    eDcmMode_BusShift          = 1,
    eDcmMode_MasterShift       = 2,
    eDcmMode_LinkLayerRefClock = 3,
    eDcmMode_MasterRefClock    = 4,
    eDcmMode_Dcx               = 5,

    /* Borland C++ datatype alignment correction */
    eDcmMode_BCppDummy      = 0xFFFFFFFF
} EC_T_DCM_MODE;

#include EC_PACKED_INCLUDESTART(8)
typedef struct _EC_T_DCM_CONFIG_BUSSHIFT
{
    EC_T_INT                    nCtlSetVal;         /*< [in] controller set val in nsec */
    EC_T_INT                    nCtlGain;           /*< [in] controller gain */
    EC_T_INT                    nCtlDriftErrorGain; /*< [in] controller drift error gain */
    EC_T_INT                    nMaxValidVal;       /*< [in] max valid input value */
    EC_T_BOOL                   bLogEnabled;        /*< [in] EC_TRUE if logging information should be generated */
    EC_T_DWORD                  dwInSyncLimit;      /*< [in] limit in nsec for InSync monitoring */
    EC_T_DWORD                  dwInSyncSettleTime; /*< [in] settle time in msec for InSync monitoring */
    EC_T_BOOL                   bCtlOff;            /*< [in] EC_TRUE if controller should not adjust the reference clock (for diagnostic only) */
} EC_PACKED(8)  EC_T_DCM_CONFIG_BUSSHIFT, *EC_PT_DCM_CONFIG_BUSSHIFT;
#include EC_PACKED_INCLUDESTOP

#include EC_PACKED_INCLUDESTART(8)
typedef struct _EC_T_DCM_CONFIG_MASTERSHIFT
{
    EC_T_INT                    nCtlSetVal;         /*< [in] controller set val in nsec */
    EC_T_INT                    nCtlGain;           /*< [in] controller gain */
    EC_T_INT                    nCtlDriftErrorGain; /*< [in] controller drift error gain */
    EC_T_INT                    nMaxValidVal;       /*< [in] max valid input value */
    EC_T_BOOL                   bLogEnabled;        /*< [in] EC_TRUE if logging information should be generated */
    EC_T_DWORD                  dwInSyncLimit;      /*< [in] limit in nsec for InSync monitoring */
    EC_T_DWORD                  dwInSyncSettleTime; /*< [in] settle time in msec for InSync monitoring */
    EC_T_BOOL                   bCtlOff;            /*< [in] EC_TRUE if controller should not adjust the reference clock (for diagnostic, or self adjust using emDcmGetAdjust()) */
} EC_PACKED(8)  EC_T_DCM_CONFIG_MASTERSHIFT, *EC_PT_DCM_CONFIG_MASTERSHIFT;
#include EC_PACKED_INCLUDESTOP

#include EC_PACKED_INCLUDESTART(8)
typedef struct _EC_T_DCM_CONFIG_LINKLAYERREFCLOCK
{
    EC_T_DWORD                  dwUnused;
} EC_PACKED(8)  EC_T_DCM_CONFIG_LINKLAYERREFCLOCK, *EC_PT_DCM_CONFIG_LINKLAYERREFCLOCK;
#include EC_PACKED_INCLUDESTOP

#include EC_PACKED_INCLUDESTART(8)
typedef struct _EC_T_DCM_CONFIG_MASTERREFCLOCK
{
    EC_T_INT                    nCtlSetVal;         /*< [in] controller set val in nsec */
    EC_T_BOOL                   bLogEnabled;        /*< [in] EC_TRUE if logging information should be generated */
    EC_T_DWORD                  dwInSyncLimit;      /*< [in] limit in nsec for InSync monitoring */
    EC_T_DWORD                  dwInSyncSettleTime; /*< [in] settle time in msec for InSync monitoring */
} EC_PACKED(8)  EC_T_DCM_CONFIG_MASTERREFCLOCK, *EC_PT_DCM_CONFIG_MASTERREFCLOCK;
#include EC_PACKED_INCLUDESTOP

#include EC_PACKED_INCLUDESTART(8)
typedef struct _EC_T_DCM_CONFIG_DCX
{
    EC_T_DCM_CONFIG_MASTERSHIFT MasterShift;
    EC_T_INT                    nCtlSetVal;             /*< [in] controller set val in nsec */
    EC_T_INT                    nCtlGain;               /*< [in] controller gain */
    EC_T_INT                    nCtlDriftErrorGain;     /*< [in] controller drift error gain */
    EC_T_INT                    nMaxValidVal;           /*< [in] max valid input value */
    EC_T_BOOL                   bLogEnabled;            /*< [in] EC_TRUE if logging information should be generated */
    EC_T_DWORD                  dwInSyncLimit;          /*< [in] limit in nsec for InSync monitoring */
    EC_T_DWORD                  dwInSyncSettleTime;     /*< [in] settle time in msec for InSync monitoring */
    EC_T_BOOL                   bCtlOff;                /*< [in] EC_TRUE if controller should not adjust the reference clock (for diagnostic, or self adjust using emDcmGetAdjust()) */
    EC_T_WORD                   wExtClockFixedAddr;     /*< [in] Fixed address of external clock slave (publishing PDO 0x10F4) (optional if ENI is generated by EcEngineer) */
    EC_T_DWORD                  dwExtClockTimeout;      /*< [in] Wait timeout for external clock slave */
} EC_PACKED(8)  EC_T_DCM_CONFIG_DCX, *EC_PT_DCM_CONFIG_DCX;
#include EC_PACKED_INCLUDESTOP

#include EC_PACKED_INCLUDESTART(8)
typedef struct _EC_T_DCM_CONFIG
{
    EC_T_DCM_MODE               eMode;
    union {
    EC_T_DCM_CONFIG_BUSSHIFT          BusShift;
    EC_T_DCM_CONFIG_MASTERSHIFT       MasterShift;
    EC_T_DCM_CONFIG_LINKLAYERREFCLOCK LinkLayerRefClock;
    EC_T_DCM_CONFIG_MASTERREFCLOCK    MasterRefClock;
    EC_T_DCM_CONFIG_DCX               Dcx;
    EC_T_DWORD                        adwReserved[32];
    } EC_PACKED(8) u;
} EC_PACKED(8)  EC_T_DCM_CONFIG, *EC_PT_DCM_CONFIG;
#include EC_PACKED_INCLUDESTOP

#include EC_PACKED_INCLUDESTART(8)
typedef struct _EC_T_DCM_LOG
{
    EC_T_DWORD                  dwMsecCounter;
    EC_T_INT                    nCtlSetVal;
    EC_T_DWORD                  dwBusTime;
    EC_T_INT                    nCtlErrorNsec;
    EC_T_INT                    nDrift;
    EC_T_DWORD                  dwErrorCode;
    EC_T_BOOL                   bDcmInSync;
    EC_T_BOOL                   bDcInSync;
    EC_T_INT                    nSystemTimeDifference;
} EC_PACKED(8)  EC_T_DCM_LOG, *EC_PT_DCM_LOG;
#include EC_PACKED_INCLUDESTOP
#else
struct _EC_T_DC_CONFIGURE;
struct _EC_T_DCM_CONFIG;
#endif /* INCLUDE_DC_SUPPORT */

/* ecatGetSlaveInfo */
#include EC_PACKED_INCLUDESTART(1)
typedef struct _EC_T_GET_SLAVE_INFO
{
    EC_T_DWORD                  dwScanBusStatus;    /* 0x00 */  /*< Status during last Bus Scan */

    EC_T_DWORD                  dwVendorId;         /* 0x01 */  /*< Vendor Identification */
    EC_T_DWORD                  dwProductCode;      /* 0x02 */  /*< Product Code */
    EC_T_DWORD                  dwRevisionNumber;   /* 0x03 */  /*< Revision Number */
    EC_T_DWORD                  dwSerialNumber;     /* 0x04 */  /*< Serial Number */

    EC_T_WORD                   wPortState;         /* 0x05 */  /*< [out] port link state (SB Instance)*/
    EC_T_WORD                   wReserved;                      /*< Res */

    EC_T_BOOL                   bDcSupport;         /* 0x06 */  /*< [out] slave does support DC*/
    EC_T_BOOL                   bDc64Support;       /* 0x07 */  /*< [out] slave does support 64Bit DC*/

    EC_T_WORD                   wAliasAddress;      /* 0x08 */  /*< [out] slave alias address*/
    EC_T_WORD                   wPhysAddress;                   /*< [out] slave station address*/

    EC_T_DWORD                  dwPdOffsIn;         /* 0x09 */  /*< [out] process data offset of Input Data (in bits)*/
    EC_T_DWORD                  dwPdSizeIn;         /* 0x0A */  /*< [out] process data size of Input Data (in bits)*/
    EC_T_DWORD                  dwPdOffsOut;        /* 0x0B */  /*< [out] process data offset of Output Data (in bits)*/
    EC_T_DWORD                  dwPdSizeOut;        /* 0x0C */  /*< [out] process data size of Output Data*/
    EC_T_DWORD                  dwPdOffsIn2;        /* 0x0D */  /*< [out] process data offset of Input data (in bits)*/
    EC_T_DWORD                  dwPdSizeIn2;        /* 0x0E */  /*< [out] process data size of Input Data (in bits)*/
    EC_T_DWORD                  dwPdOffsOut2;       /* 0x0F */  /*< [out] process data offset of Output Data (in bits)*/
    EC_T_DWORD                  dwPdSizeOut2;       /* 0x10 */  /*< [out] process data size of Output Data*/
    EC_T_DWORD                  dwPdOffsIn3;        /* 0x11 */  /*< [out] process data offset of Input Data (in bits)*/
    EC_T_DWORD                  dwPdSizeIn3;        /* 0x12 */  /*< [out] process data size of Input Data (in bits)*/
    EC_T_DWORD                  dwPdOffsOut3;       /* 0x13 */  /*< [out] process data offset of Output Data (in bits)*/
    EC_T_DWORD                  dwPdSizeOut3;       /* 0x14 */  /*< [out] process data size of Output Data*/
    EC_T_DWORD                  dwPdOffsIn4;        /* 0x15 */  /*< [out] process data offset of Input Data (in bits)*/
    EC_T_DWORD                  dwPdSizeIn4;        /* 0x16 */  /*< [out] process data size of Input Data (in bits)*/
    EC_T_DWORD                  dwPdOffsOut4;       /* 0x17 */  /*< [out] process data offset of Output Data (in bits)*/
    EC_T_DWORD                  dwPdSizeOut4;       /* 0x18 */  /*< [out] process data size of Output Data*/

    EC_T_WORD                   wCfgPhyAddress;     /* 0x19 */  /*< [out] slave configured station address*/
    EC_T_WORD                   wReserved2;                     /*< reserved */

    EC_T_CHAR                   abyDeviceName[ECAT_DEVICE_NAMESIZE];
                                                    /* 0x1A */  /*< [out] slave name of configuration*/
    EC_T_BOOL                   bIsMailboxSlave;    /* 0x2E */  /*< [out] whether slave support mailboxes*/
    EC_T_DWORD                  dwMbxOutSize;       /* 0x2F */  /*< [out] mailbox 1 output size*/
    EC_T_DWORD                  dwMbxInSize;        /* 0x30 */  /*< [out] mailbox 1 input size*/
    EC_T_DWORD                  dwMbxOutSize2;      /* 0x31 */  /*< [out] mailbox 2 output size*/
    EC_T_DWORD                  dwMbxInSize2;       /* 0x32 */  /*< [out] mailbox 2 input size*/

    EC_T_DWORD                  dwErrorCode;        /* 0x33 */  /*< [out] last return code*/
    EC_T_DWORD                  dwSBErrorCode;      /* 0x34 */  /*< [out] last return value from SB*/

    EC_T_BYTE                   byPortDescriptor;   /* 0x35 */  /*< [out] Port Descriptor (ESC register 0x0007) */
    EC_T_BYTE                   byESCType;                      /*< [out] ESC Node Type */
    EC_T_WORD                   wSupportedMbxProtocols;         /*< [out] supported mailbox protocols: AoE, EoE, CoE, FoE, SoE */

    EC_T_WORD                   wAlStatusValue;     /* 0x36 */  /*< [out] AL Status Register Value (ESC register 0x0130) */
    EC_T_WORD                   wAlStatusCode;                  /*< [out] AL Status Code (ESC register 0x0134) */

    EC_T_BOOL                   bIsOptional;        /* 0x37 */  /*< [out] slave is in an optional hot connect group */
    EC_T_BOOL                   bIsPresent;         /* 0x38 */  /*< [out] slave is currently present on bus */

    EC_T_WORD                   wNumProcessVarsInp; /* 0x39 */  /*< [out] number of output process data variables*/
    EC_T_WORD                   wNumProcessVarsOutp;            /*< [out] number of input process data variables */

    EC_T_DWORD                  dwSlaveId;          /* 0x3A */  /*< [out] slave ID */
    EC_T_BOOL                   bIsHCGroupPresent;  /* 0x3B */  /*< [out] the hot connect group of the slave is present */

    EC_T_DWORD                  aPortSlaveIds[ESC_PORT_COUNT];  /* 0x3C */  /*< [out] slave IDs connected to ports */

    EC_T_DWORD                  dwSystemTimeDifference;         /* 0x40   < out System time difference (ESC register 0x092C) */

    EC_T_DWORD                  adwReserved[18];    /* 0x41 */  /*< [out] Reserved*/

} EC_PACKED(1)  EC_T_GET_SLAVE_INFO, *EC_PT_GET_SLAVE_INFO; /* Size = 0x53 * DWORD */
#include EC_PACKED_INCLUDESTOP

/* emGetSlaveInpVarInfo / emGetSlaveOutpVarInfo*/
#include EC_PACKED_INCLUDESTART(1)
typedef struct _EC_T_PROCESS_VAR_INFO
{
    EC_T_CHAR                   szName[MAX_PROCESS_VAR_NAME_LEN];   /**< [out] Name of the found process variable */
    EC_T_WORD                   wDataType;                          /**< [out] Data type of the found process variable */
    EC_T_WORD                   wFixedAddr;                         /**< [out] Station address of the slave that is owner of this variable */
    EC_T_INT                    nBitSize;                           /**< [out] Size in bit of the found process variable */
    EC_T_INT                    nBitOffs;                           /**< [out] Bit offset in the process data image */
